Rainchus/marioparty4/src/REL/m409Dll/player.c
u32 lbl_1_data_1EC = 0x41C64E6D;

s32 fn_1_ABB4(void) {
    lbl_1_data_1EC *= 0x41C64E6D;
    lbl_1_data_1EC += 0x3039;
    return (lbl_1_data_1EC >> 0x10);
}

void fn_1_AC08(s32* arg0, s32 arg1) {
    s32 temp_r29;
    s32 temp_r30;
    s32 var_r31;
    
    for (var_r31 = 0; var_r31 < arg1; var_r31++) {
        arg0[var_r31] = var_r31;
    }
    
    for (var_r31 = 0; var_r31 < arg1; var_r31++) {
        temp_r30 = (arg1 * (fn_1_ABB4() / 65536.0f));
        temp_r29 = arg0[var_r31];
        arg0[var_r31] = arg0[temp_r30];
        arg0[temp_r30] = temp_r29;
    }
}

f32 fn_1_AD40(f32 arg0, f32 arg1, f32 arg2) {
    f32 var_f31;
    f32 var_f30;
    f32 var_f29;

    var_f31 = fmodf(arg1 - arg0, 360.0);
    if (var_f31 < 0.0f) {
        var_f31 += 360.0f;
    }
    if (var_f31 > 180.0f) {
        var_f31 -= 360.0f;
    }
    var_f31 = fmodf(arg0 + ((1.0f - arg2) * var_f31), 360.0);
    if (var_f31 < 0.0f) {
        var_f31 += 360.0f;
    }
    if (var_f31 >= 180.0f) {
        var_f31 -= 360.0f;
    }
    return var_f31;
}

f32 fn_1_AE94(f32 arg8, f32 arg9, f32 argA, f32 argB) {
    f32 temp_f31;
    f32 var_f30;

    temp_f31 = (1.0 - arg8);
    var_f30 = ((argB * (arg8 * arg8)) + ((arg9 * (temp_f31 * temp_f31)) + (2.0 * (argA * (temp_f31 * arg8)))));
    return var_f30;
}

void fn_1_AF0C(f32* arg0, f32* arg1, f32* arg2, f32* arg3, f32 arg8) {
    s32 var_r31;

    for (var_r31 = 0; var_r31 < 3; var_r31++) {
        *arg3 = fn_1_AE94(arg8, *arg0++, *arg1++, *arg2++);
        arg3++;
    }
}

f32 fn_1_B028(f32 arg8, f32 arg9, f32 argA, f32 argB) {
    f32 var_f31;

    var_f31 = (2.0 * ((arg8 * argB) + (((arg8 - 1.0) * arg9) + ((1.0 - (2.0 * arg8)) * argA))));
    return var_f31;
}

void fn_1_B0A0(f32* arg0, f32* arg1, f32* arg2, f32* arg3, f32 arg8) {
    f32 spC[3];
    f32 var_f29;
    s32 var_r31;

    for (var_r31 = 0; var_r31 < 3; var_r31++) {
        spC[var_r31] = fn_1_B028(arg8, *arg0++, *arg1++, *arg2++);
    }
    
    var_f29 = sqrtf((spC[2] * spC[2]) + ((spC[0] * spC[0]) + (spC[1] * spC[1])));
    
    if (var_f29) {
        var_f29 = (1.0 / var_f29);
        for (var_r31 = 0; var_r31 < 3; var_r31++) {
            *arg3++ = var_f29 * spC[var_r31];
        }
    } else {
        *arg3++ = 0.0f;
        *arg3++ = 0.0f;
        *arg3++ = 1.0f;
    }
}

f32 fn_1_B378(Vec* arg0) {
    f32 var_f30;
    f32 var_f29;

    var_f30 = (arg0->z * arg0->z) + ((arg0->x * arg0->x) + (arg0->y * arg0->y));
    var_f30 = sqrtf(var_f30);
    if (var_f30 != 0) {
        var_f29 = 1.0f / var_f30;
        arg0->x *= var_f29;
        arg0->y *= var_f29;
        arg0->z *= var_f29;
    } else {
        arg0->x = arg0->y = arg0->z = 0.0f;
    }
    return var_f30;
}

f32 fn_1_B510(Vec* arg0, Vec* arg1, Vec* arg2, f32 arg8) {
    if (arg8 <= 0.0f) {
        arg2->x = arg0->x;
        arg2->y = arg0->y;
        arg2->z = arg0->z;
        return 0.0f;
    }
    if (arg8 >= 1.0f) {
        arg2->x = (arg0->x + arg1->x);
        arg2->y = (arg0->y + arg1->y);
        arg2->z = (arg0->z + arg1->z);
        return 1.0f;
    }
    arg2->x = (arg0->x + (arg8 * arg1->x));
    arg2->y = (arg0->y + (arg8 * arg1->y));
    arg2->z = (arg0->z + (arg8 * arg1->z));
    return arg8;
}

f32 fn_1_B5E8(Vec* arg0, Vec* arg1, Vec* arg2) {
    f32 temp_f30;
    f32 var_f31;

    var_f31 = (arg2->z * (arg1->z - arg0->z)) + ((arg2->x * (arg1->x - arg0->x)) + (arg2->y * (arg1->y - arg0->y)));
    temp_f30 = -((arg2->z * arg2->z) + ((arg2->x * arg2->x) + (arg2->y * arg2->y)));
    if (temp_f30 != 0.0f) {
        var_f31 /= temp_f30;
    }
    return var_f31;
}